### How to import documents using Pandas

## 1. Excel

In [9]:
import pandas as pd

df_excel = pd.read_excel('multiple.xlsx')
df_excel.head(2)

        Date    Open    High     Low   Close   Volume  Adj Close
0 2014-04-17  199.61  202.29  194.08  198.12  5926800     198.12
1 2014-04-16  197.00  199.99  190.82  199.11  7202200     199.11

## 2. CSV

In [10]:
import pandas as pd
df_csv = pd.read_csv('world_temp.csv')
df_csv.head(2)

   year     city        country  avg_temp
0  1849  Abidjan  C么te D'Ivoire     25.58
1  1850  Abidjan  C么te D'Ivoire     25.52

## 3. TXT

In [17]:
import pandas as pd
df_txt = pd.read_csv('savingsrate.txt')
df_txt.head()

         DATE         RATE
0  1959-01-01          8.3
1  1959-02-01          7.7
2  1959-03-01          7.4
3  1959-04-01          8.3
4  1959-05-01          7.8

In [20]:
#sum
cols = df_txt.columns

NameError: name 'strip' is not defined